app/controllers/outfits_controller.rb

  def index
    @outfits = Outfit.all.reverse
---
SELECT "outfits".* FROM "outfits"

  def create
    @outfit = Outfit.new(set_params)
    @outfit.user_id = current_user.id
    if @outfit.save
---
INSERT INTO "outfits" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @outfit = current_user.outfits.find(params[:id])
    if @outfit.update_attributes(set_params)
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = $1 AND "outfits"."id" = $2 LIMIT 1  [["user_id", 1], ["id", "1"]]
UPDATE "outfits" SET "type_of_outfit" = $1, "occasion" = $2, "brand_name" = $3, "price" = $4, "accessories" = $5, "sender_comment" = $6, "updated_at" = $7 WHERE "outfits"."id" = 1

  def show
    @outfit = current_user.outfits.find(params[:id])
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = $1 AND "outfits"."id" = $2 LIMIT 1  [["user_id", 1], ["id", "1"]]