app/controllers/sessions_controller.rb

 def create
    @user = User.where(:email => params[:session][:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'mike@mike.com' ORDER BY "users"."id" ASC LIMIT 1